rhcsa/networking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>networking</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">networking</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">ip</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">commands</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
- VIEW
  - ip link show ; link status of the active network adapters
  - ip -s link show ;  display statistics about network performance
  - ip address show ; IP address information. same as link + ip address info
  - ip address show eth0 ; current configuration for device eth0
  - ip neigh ; table of hardware and IP addresses on the local computer
    - can also set or modify ARP table entries manually
  - ip neigh show
    - all ARP entries in the local database
  - ip route ; display routing tables
  - ip -r route ; resolve /etc/hosts &amp; dns servers
    - equivalent to deprecated netstat -nr
- CREATE
  - ip addr add 192.168.122.150/24 dev eth0
- MODIFY
  - ip link set dev eth0 down
  - ip link set dev eth0 up
</pre>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">aliases</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>ip a s
</li>
<li>ip addr show
</li>
<li>address addr a
</li>
<li>show s
</li>
<li>neigh n
</li>
<li>route r
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">ping and traceroute</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>ping 127.0.0.1
</li>
<li>traceroute -n 192.168.20.5 ; numbers not hostnames
</li>
<li>traceroute -I ; icmp
</li>
<li>traceroute -T ; tcp
</li>
<li>tracepath ; doesn't require root like traceroute
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">miscellaneous</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>ifup and ifdown ; call appropriate configuration files and scripts in the
/etc/sysconfig/network-scripts directory
</li>
<li>dhclient eth0 ; Dynamically Configures IP Addresse for <i>device</i>
</li>
<li>/etc/resolv.conf ; adds dns servers here
</li>
<li>systemctl status network ; check current status of network
</li>
<li>systemctl restart network ; restart networking
</li>
<li>dig @192.168.122.1 mheducation.com
</li>
<li>host mheducation.com 192.168.122.1 ; HOST(1) - DNS lookup utility
</li>
<li>hostname newname ; temporary ; HOSTNAME(1)  - show or set the system's host name
</li>
<li>hostnamectl set-hostname newname ; permanent. updates /etc/hostname
<ul class="org-ul">
<li>HOSTNAMECTL(1) - Control the system hostname
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">ss socket statistics</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>ss ; socket statistics. replaces netstat
</li>
<li>ss -tuna4
</li>
<li>all (-a) network sockets
</li>
<li>IPv4 (-4)
</li>
<li>TCP (-t)
</li>
<li>UDP (-u)
</li>
<li>numeric (-n) format
</li>
<li>-p PID of the process using each socket.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">network manager</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>systemctl status NetworkManager
</li>
</ul>
<p>
NMCLI
</p>
<ul class="org-ul">
<li>nmtui
</li>
<li>nmtui - Text User Interface for controlling NetworkManager
</li>
<li>nmcli dev status
</li>
<li>profiles, also known as connections for the same network interface
</li>
<li>command-line tool for controlling NetworkManager
</li>
<li>nmcli con reload
</li>
<li>nmcli con down eth0
</li>
<li>nmcli con up eth0
</li>
<li>nmcli con show
</li>
<li>nmcli con add con-name "eth0-work" type ethernet ifname eth0
</li>
<li>nmcli con mod "eth0-work" ipv4.addresses "192.168.20.100/24 192.168.20.1"
</li>
<li>nmcli con show connection-id
</li>
<li>nmcli con mod "eth0-work" +ipv4.dns 192.168.20.1
</li>
<li>nmcli con up "eth0-work" ; switch
</li>
<li>nmcli con mod "eth0-work" connection.autoconnect no ; don't start at boot
</li>
</ul>
<p>
NM-CONNECTION-EDITOR
</p>
<ul class="org-ul">
<li>nm-connection-editor ; gui
</li>
<li>Applications &gt; Sundry &gt; Network Connections. not on my system!
</li>
</ul>



<p>
<a href="rhcsa.html">back</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
